ext-sources-app/tests/test_files/soap/EPLS_testSearch_entity_req.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:impl="http://impl.services.screening.medicaid.gov/">
   <soapenv:Header/>
   <soapenv:Body>
      <impl:search>
         <arg0>
            <name>walter</name>
            <npiType>GROUP</npiType>
         </arg0>
      </impl:search>
   </soapenv:Body>
</soapenv:Envelope>